back-end/app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities"
---
  def index
    activities = Activity.all