back-end/app/controllers/drawings_controller.rb

SELECT "drawings".* FROM "drawings"
---
  def index
    drawings = Drawing.all

INSERT INTO "drawings" ("svgdrawing", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["svgdrawing", "{\"lines\":[],\"width\":400,\"height\":400}"], ["created_at", "2021-01-22 20:02:09.812497"], ["updated_at", "2021-01-22 20:02:09.812497"]]
---
   def create
    newdraw = Drawing.create(svgdrawing: params[:data][:svgdrawing])