back-end/app/controllers/favorite_activities_controller.rb

  def index
    favorite_activities = FavoriteActivity.all
---
SELECT "favorite_activities".* FROM "favorite_activities"