back-end/app/controllers/favorite_drawings_controller.rb

  def index
    favorite_drawings = FavoriteDrawing.all
---
SELECT "favorite_drawings".* FROM "favorite_drawings"

   def create
    drawFav = FavoriteDrawing.create(user_id: params[:data][:user_id] ,
                                    drawing_id: params[:data][:drawing_id],
                                    drawing: params[:data][:drawing])
---
INSERT INTO "favorite_drawings" ("user_id", "drawing_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 10], ["drawing_id", 19], ["created_at", "2021-01-26 00:51:18.724149"], ["updated_at", "2021-01-26 00:51:18.724149"]]

  def destroy
    deleteDraw = FavoriteDrawing.find_by(id: params[:id])
    deleteDraw.destroy
---
SELECT "favorite_drawings".* FROM "favorite_drawings" WHERE "favorite_drawings"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "favorite_drawings" WHERE "favorite_drawings"."id" = $1  [["id", 1]]